
## Plan Result (shared-snowplow-consumer-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/18941)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * aws_cloudwatch_log_group.shared-snowplow-consumer-app_app-log-group_3D66A20E
  * aws_cloudwatch_log_group.shared-snowplow-consumer-app_aws-otel-collector-log-group_408C8F4B
  * local_file.shared-snowplow-consumer-app_application_ecs_service_appspec_7674CFF9
* Delete
  * aws_cloudwatch_log_group.shared-snowplow-consumer-app_application_ecs_service_ecs-app_167813A8
  * aws_cloudwatch_log_group.shared-snowplow-consumer-app_application_ecs_service_ecs-xray-daemon_67344D58
* Replace
  * aws_ecs_task_definition.shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_cloudwatch_log_group.shared-snowplow-consumer-app_app-log-group_3D66A20E will be created
  + resource "aws_cloudwatch_log_group" "shared-snowplow-consumer-app_app-log-group_3D66A20E" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/Backend/SharedSnowplowConsumer-Prod/ecs/app"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = true
      + tags              = {
          + "environment" = "Prod"
          + "service"     = "SharedSnowplowConsumer"
        }
      + tags_all          = {
          + "environment" = "Prod"
          + "service"     = "SharedSnowplowConsumer"
        }
    }

  # aws_cloudwatch_log_group.shared-snowplow-consumer-app_application_ecs_service_ecs-app_167813A8 will be destroyed
  # (because aws_cloudwatch_log_group.shared-snowplow-consumer-app_application_ecs_service_ecs-app_167813A8 is not in configuration)
  - resource "aws_cloudwatch_log_group" "shared-snowplow-consumer-app_application_ecs_service_ecs-app_167813A8" {
      - arn               = "arn:aws:logs:us-east-1:996905175585:log-group:/ecs/SharedSnowplowConsumer-Prod/app20230717165004556700000007" -> null
      - id                = "/ecs/SharedSnowplowConsumer-Prod/app20230717165004556700000007" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/SharedSnowplowConsumer-Prod/app20230717165004556700000007" -> null
      - name_prefix       = "/ecs/SharedSnowplowConsumer-Prod/app" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "environment" = "Prod"
          - "service"     = "SharedSnowplowConsumer"
        } -> null
      - tags_all          = {
          - "environment" = "Prod"
          - "service"     = "SharedSnowplowConsumer"
        } -> null
    }

  # aws_cloudwatch_log_group.shared-snowplow-consumer-app_application_ecs_service_ecs-xray-daemon_67344D58 will be destroyed
  # (because aws_cloudwatch_log_group.shared-snowplow-consumer-app_application_ecs_service_ecs-xray-daemon_67344D58 is not in configuration)
  - resource "aws_cloudwatch_log_group" "shared-snowplow-consumer-app_application_ecs_service_ecs-xray-daemon_67344D58" {
      - arn               = "arn:aws:logs:us-east-1:996905175585:log-group:/ecs/SharedSnowplowConsumer-Prod/xray-daemon20230717165003255600000003" -> null
      - id                = "/ecs/SharedSnowplowConsumer-Prod/xray-daemon20230717165003255600000003" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/ecs/SharedSnowplowConsumer-Prod/xray-daemon20230717165003255600000003" -> null
      - name_prefix       = "/ecs/SharedSnowplowConsumer-Prod/xray-daemon" -> null
      - retention_in_days = 30 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "environment" = "Prod"
          - "service"     = "SharedSnowplowConsumer"
        } -> null
      - tags_all          = {
          - "environment" = "Prod"
          - "service"     = "SharedSnowplowConsumer"
        } -> null
    }

  # aws_cloudwatch_log_group.shared-snowplow-consumer-app_aws-otel-collector-log-group_408C8F4B will be created
  + resource "aws_cloudwatch_log_group" "shared-snowplow-consumer-app_aws-otel-collector-log-group_408C8F4B" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/Backend/SharedSnowplowConsumer-Prod/ecs/aws-otel-collector"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = true
      + tags              = {
          + "environment" = "Prod"
          + "service"     = "SharedSnowplowConsumer"
        }
      + tags_all          = {
          + "environment" = "Prod"
          + "service"     = "SharedSnowplowConsumer"
        }
    }

  # aws_ecs_task_definition.shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B must be replaced
-/+ resource "aws_ecs_task_definition" "shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/SharedSnowplowConsumer-Prod:68" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/SharedSnowplowConsumer-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ environment            = [
                        {
                            name  = "NODE_ENV"
                            value = "production"
                        },
                      + {
                          + name  = "OTLP_COLLECTOR_HOST"
                          + value = "localhost"
                        },
                        {
                            name  = "SNOWPLOW_ENDPOINT"
                            value = "com-getpocket-prod1.collector.snplow.net"
                        },
                        # (2 unchanged elements hidden)
                    ]
                  ~ logConfiguration       = {
                      ~ options       = {
                          ~ awslogs-group             = "/ecs/SharedSnowplowConsumer-Prod/app20230717165004556700000007" -> "/Backend/SharedSnowplowConsumer-Prod/ecs/app"
                          + awslogs-multiline-pattern = "^\\S.+"
                            # (2 unchanged attributes hidden)
                        }
                        # (2 unchanged attributes hidden)
                    }
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (8 unchanged attributes hidden)
                },
              ~ {
                  ~ command                = [
                      - "--region",
                      - "us-east-1",
                      - "--local-mode",
                      + "--config=/etc/ecs/ecs-xray.yaml",
                    ]
                  ~ image                  = "amazon/aws-xray-daemon" -> "amazon/aws-otel-collector"
                  ~ logConfiguration       = {
                      ~ options       = {
                          ~ awslogs-group             = "/ecs/SharedSnowplowConsumer-Prod/xray-daemon20230717165003255600000003" -> "/Backend/SharedSnowplowConsumer-Prod/ecs/aws-otel-collector"
                          + awslogs-multiline-pattern = "^\\S.+"
                            # (2 unchanged attributes hidden)
                        }
                        # (2 unchanged attributes hidden)
                    }
                  ~ name                   = "xray-daemon" -> "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          ~ containerPort = 2000 -> 4138
                          ~ hostPort      = 2000 -> 4138
                          - protocol      = "udp"
                        },
                      + {
                          + containerPort = 4137
                          + hostPort      = 4137
                        },
                    ]
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "SharedSnowplowConsumer-Prod" -> (known after apply)
      ~ revision                 = 68 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "SharedSnowplowConsumer"
        }
        # (9 unchanged attributes hidden)
    }

  # local_file.shared-snowplow-consumer-app_application_ecs_service_appspec_7674CFF9 will be created
  + resource "local_file" "shared-snowplow-consumer-app_application_ecs_service_appspec_7674CFF9" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 4 to add, 0 to change, 3 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 1995, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 1995:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 3 more similar warnings elsewhere)
╵
```

</details>



## :warning: Warnings

```hcl
Warning: Deprecated attribute
 
   on cdk.tf.json line 1995, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
 1995:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
 
 The attribute "integration_key" is deprecated. Refer to the provider
 documentation for details.
 
 (and 3 more similar warnings elsewhere)
```



<!-- github-comment: {"Command":"plan","JobID":"9ed39e96-961a-4c70-8085-a7c4bc73c47c","JobName":"shared-snowplow-consumer_infrastructure_plan_prod","PRNumber":87,"Program":"tfcmt","SHA1":"3400b965f6cdcb471635202d1a208ba40b5830f1","Target":"shared-snowplow-consumer-cdk","Vars":{}} -->